apache/nuttx/arch/arm/src/stm32c0/hardware/stm32c0_pinmap.h
#define GPIO_TIM2_CH1IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_CH1IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM2_CH1IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM2_CH1IN_4     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM2_CH1OUT_1    (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_CH1OUT_2    (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM2_CH1OUT_3    (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM2_CH1OUT_4    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM2_CH2IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM2_CH2IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM2_CH2IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_TIM2_CH2OUT_1    (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM2_CH2OUT_2    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM2_CH2OUT_3    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_TIM2_CH3IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM2_CH3IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM2_CH3IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM2_CH3OUT_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM2_CH3OUT_2    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM2_CH3OUT_3    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM2_CH4IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM2_CH4IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_TIM2_CH4IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM2_CH4OUT_1    (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM2_CH4OUT_2    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_TIM2_CH4OUT_3    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN7)

/* TIM3 */

#define GPIO_TIM3_CH1IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM3_CH1IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM3_CH1IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM3_CH1IN_4     (GPIO_ALT | GPIO_FLOAT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM3_CH1IN_5     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM3_CH1IN_6     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM3_CH1OUT_1    (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM3_CH1OUT_2    (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM3_CH1OUT_3    (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM3_CH1OUT_4    (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM3_CH1OUT_5    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM3_CH1OUT_6    (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM3_CH2IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM3_CH2IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM3_CH2IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM3_CH2IN_4     (GPIO_ALT | GPIO_FLOAT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM3_CH2IN_5     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM3_CH2IN_6     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM3_CH2IN_7     (GPIO_ALT | GPIO_FLOAT | GPIO_AF11 | GPIO_PORTC | GPIO_PIN14)
#define GPIO_TIM3_CH2OUT_1    (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM3_CH2OUT_2    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM3_CH2OUT_3    (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM3_CH2OUT_4    (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM3_CH2OUT_5    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM3_CH2OUT_6    (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM3_CH2OUT_7    (GPIO_ALT | GPIO_AF11 | GPIO_PORTC | GPIO_PIN14)
#define GPIO_TIM3_CH3IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM3_CH3IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM3_CH3IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM3_CH3IN_4     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM3_CH3IN_5     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM3_CH3IN_6     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN15)
#define GPIO_TIM3_CH3OUT_1    (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM3_CH3OUT_2    (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM3_CH3OUT_3    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM3_CH3OUT_4    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM3_CH3OUT_5    (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM3_CH3OUT_6    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN15)
#define GPIO_TIM3_CH4IN_1     (GPIO_ALT | GPIO_FLOAT | GPIO_AF12 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM3_CH4IN_2     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM3_CH4IN_3     (GPIO_ALT | GPIO_FLOAT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM3_CH4IN_4     (GPIO_ALT | GPIO_FLOAT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TIM3_CH4OUT_1    (GPIO_ALT | GPIO_AF12 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM3_CH4OUT_2    (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM3_CH4OUT_3    (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM3_CH4OUT_4    (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN9)

/* TIM14 */

#define GPIO_TIM14_CH1IN_1    (GPIO_ALT | GPIO_FLOAT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_TIM14_CH1IN_2    (GPIO_ALT | GPIO_FLOAT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM14_CH1IN_3    (GPIO_ALT | GPIO_FLOAT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM14_CH1IN_4    (GPIO_ALT | GPIO_FLOAT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM14_CH1IN_5    (GPIO_ALT | GPIO_FLOAT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TIM14_CH1IN_6    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN0)
#define GPIO_TIM14_CH1OUT_1   (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_TIM14_CH1OUT_2   (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM14_CH1OUT_3   (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM14_CH1OUT_4   (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM14_CH1OUT_5   (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TIM14_CH1OUT_6   (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN0)

/* TIM15 */

