apache/nuttx/arch/arm/src/stm32c0/hardware/stm32c0_pinmap.h
#define GPIO_TIM15_BKIN_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM15_BKIN_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM15_BKIN_3     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_TIM15_BKIN_4     (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN15)
#define GPIO_TIM15_CH1IN_1    (GPIO_ALT | GPIO_FLOAT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM15_CH1IN_2    (GPIO_ALT | GPIO_FLOAT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM15_CH1IN_3    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_TIM15_CH1OUT_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM15_CH1OUT_2   (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM15_CH1OUT_3   (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_TIM15_CH1NOUT_1  (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM15_CH1NOUT_2  (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TIM15_CH1NOUT_3  (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM15_CH1NOUT_4  (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN1)
#define GPIO_TIM15_CH2IN_1    (GPIO_ALT | GPIO_FLOAT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM15_CH2IN_2    (GPIO_ALT | GPIO_FLOAT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM15_CH2IN_3    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_TIM15_CH2OUT_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM15_CH2OUT_2   (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM15_CH2OUT_3   (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN2)

/* TIM16 */

#define GPIO_TIM16_BKIN_1     (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM16_BKIN_2     GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM16_CH1IN_1    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM16_CH1IN_2    (GPIO_ALT | GPIO_FLOAT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM16_CH1IN_3    (GPIO_ALT | GPIO_FLOAT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM16_CH1IN_4    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM16_CH1IN_5    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_TIM16_CH1OUT_1   (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM16_CH1OUT_2   (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM16_CH1OUT_3   (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM16_CH1OUT_4   (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM16_CH1OUT_5   (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_TIM16_CH1NOUT_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM16_CH1NOUT_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN6)

/* TIM17 */

#define GPIO_TIM17_BKIN_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_TIM17_BKIN_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM17_CH1IN_1    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM17_CH1IN_2    (GPIO_ALT | GPIO_FLOAT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM17_CH1IN_3    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM17_CH1IN_4    (GPIO_ALT | GPIO_FLOAT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN14)
#define GPIO_TIM17_CH1IN_5    (GPIO_ALT | GPIO_FLOAT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_TIM17_CH1OUT_1   (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM17_CH1OUT_2   (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM17_CH1OUT_3   (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM17_CH1OUT_4   (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN14)
#define GPIO_TIM17_CH1OUT_5   (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_TIM17_CH1NOUT_1  (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_TIM17_CH1NOUT_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN7)

/* USB */

#define GPIO_USB_DM           (GPIO_INPUT | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USB_DP           (GPIO_INPUT | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN12)

#endif /* __ARCH_ARM_SRC_STM32C0_HARDWARE_STM32C0_PINMAP_H */
